---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteNoWorkplane
source: html/192fec93-e101-3356-5e5f-94be08de3ea7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteNoWorkplane Property

Can't paste because there is no corresponding Work Plane. Set workplane or switch to view with appropriate workplane.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteNoWorkplane { get; }
```